<script lang="ts" setup>
import PageTextTitle from '~/components/system/atoms/PageTextTitle.vue';
</script>
<template>
  <div>
    <NuxtLayout name="single-content">
      <div class="twls-layout">
        <article class="twls-container">
          <PageTextTitle>はじめに</PageTextTitle>
          <section class="twls-content">
            <h2 class="twls-h2">デザインシステムとは</h2>
            <p>
              デザインシステムは、特定の製品や組織において、統一されたデザインの思想の基に定義された、デザインのルールをまとめたものです。昔からプロダクトデザインやグラフィックデザインの世界において、ある程度の規模のある組織には何らかのデザインシステムが作られていました。
            </p>
            <p>
              しかし、2010年ごろからは、デジタルデバイスの浸透やインターネットの深い普及によって、スクリーンを中心としたプロダクトデザインが増えてきました。このスクリーンに対するデザインシステムは個々の組織内には漠然としたものはあったのでしょうが、広く使われるアプリケーションなどには、共通して考えられたデザインシステムが必要だという機運が高まり、またそれが公表されるようになりました。
            </p>
            <p>
              古くはAppleのHuman interface
              guidelinesが有名ですが、その後Twitter社のエンジニアが開発したBootstrapや、GoogleのMaterialDesign、日本ではデジタル庁のデザインシステムなどが生まれました。
            </p>
            <h3 class="twls-h3">デザインシステムとしての The Wheels</h3>
            <p>
              このドキュメントでは、The Wheelsという、知的・自転車の組織で利用するためのデザインシステムについて定義します。しかし、既にある、またはこれから生まれるであろうデザインシステムには、その組織や製品において、<strong>そうであるべきデザインのあり方</strong>が定義されています。もちろん、どのデザインシステムにも、<strong>ユーザーの利便性を追求する姿勢</strong>は共通します。そこに間違いがあるとも言えません。しかし、<strong>その組織の哲学（Philosopy：フィロソフィー）</strong>に基づいて開発されているものであり、<strong>The Wheelsも同じ</strong>です。The Wheelsは、知的・自転車の考えるデザインの哲学を元に開発されていますから、まずは組織哲学とデザインシステムとの関係性から説明します。
            </p>
          </section>
          <section class="twls-content">
            <h2 class="twls-h2">The Wheelsの目的</h2>
            <p>
              知的・自転車の提供するものは、大きく2つあります。それは、コンテンツとデジタルシステムです。コンテンツは、Webサイトであったり、記事コンテンツであったり、動画コンテンツであったり、チラシやパンフレットであったりします。一方、デジタルシステムとは、Webシステムだったり、スマホアプリだったり、業務改善システムであったりします。
            </p>
            <p>
              この2つの違いとして、明確には「コンテンツは原則として一方通行」「システムは双方向であり、データの読み書きができるもの」という考え方があります。Webサイトにも「お問い合わせフォーム」があったりして、必ずしも厳密に区分けできるものではありません。しかし、大きな方向性として、こういう区分となっています。
            </p>
            <p>
              いずれにしても、The
              wheelsは、知的・自転車のデザインシステムとして、この双方に適用できる重要な仕組みとなります。
            </p>
            <p>
              極端に言ってしまえば、知的・自転車の製品製造に関わるみなさんは、このThe
              Wheelsというデザインガイドにさえ従っていれば、知的・自転車の求める最低限の品質は担保されると考えていただいて構いません。
            </p>
            <p>
              The
              Wheelsは、知的・自転車の製品水準を一定に保ち、将来に向けて品質を高めていくための基準であり、そのパーツ集であると言えるでしょう。
            </p>
          </section>
        </article>
      </div>
    </NuxtLayout>
  </div>
</template>
