<script lang="ts" setup>
import SmallScrollTextWindow from '~/components/system/elements/SmallScrollTextWindow.vue';
</script>

<template>
  <SmallScrollTextWindow>
    <h2>掲載情報等について</h2>
    <p>当ウェブサイトに掲載される情報・コンテンツについて、合同会社 知的・自転車は正確性や妥当性について細心の注意を払い調査した上で掲載していますが、その全てを保証するものではありません。掲載情報に基づく閲覧者の行動における一切の不利益等に関する補償および責任は負いませんので、ご了承ください。</p>
    <p>当ウェブサイトに掲載される情報は、予告なく変更、または削除されることがあります。また、技術的事情や天災等の社会的事情により、ウェブサイトの運用を中断、中止する場合があります。</p>
    <h2>著作権等について</h2>
    <p>当ウェブサイトに掲載されているコンテンツ（文章・写真・イラスト・画像・映像・動画・音楽・コンピュータープログラム等）は、日本国著作権法およびその他の法令に基づき、合同会社 知的自転車が保有します。</p>
    <p>これらのコンテンツには、他社（他者）のコンテンツを購入、無料でのライセンス配布等により利用している箇所があります。これらは、当該他社コンテンツの利用について、適法に処理したものであり、著作権法を侵すものではありません。</p>
    <p>また、著作権法第32条に基づく引用を行う場合があります。さらに、同32条第2項に基づき、国もしくは地方公共団体の機関、独立行政法人または地方独立行政法人の発表するコンテンツを利用・掲載する場合があります。この場合、適法の範囲内で行われます。</p>
    <p>当ウェブサイトに掲載されているコンテンツを、著作権法第32条で定める引用の定義を超えて他者が利用することを固く禁じます。</p>
    <h2>禁止事項について</h2>
    <p>当ウェブサイトを利用するにあたり、以下の行為を禁じます。</p>
    <ol>
      <li>第三者、もしくは合同会社 知的・自転車の財産・プライバシーを侵害する行為、またはその恐れがある行為。</li>
      <li>第三者、もしくは合同会社 知的・自転車に不利益や損害を与える行為、またはその恐れがある行為。</li>
      <li>第三者、もしくは合同会社 知的・自転車の名誉や信用を毀損する行為。</li>
      <li>公序良俗に反する行為、またはその恐れがある行為。</li>
      <li>犯罪行為、もしくは犯罪に結びつく行為、その準備行動。</li>
      <li>他人、あるいは虚偽の登録による利用行為。</li>
      <li>その他、合同会社 知的・自転車が不適切と判断する行為。</li>
    </ol>
    <h2>リンクについて</h2>
    <p>当ウェブサイトへのリンクはご自由に行なってください。ただし、リンクされたページは予告なく削除、変更等される場合がありますので、ご了承ください。</p>
    <h2>免責事項</h2>
    <p>合同会社 知的自転車は、サイト閲覧者がこのウェブサイトを利用したことによって生じたいかなる損害についても、責任を負うものではありません。</p>
    <p>合同会社 知的自転車は、当ウェブサイトの運営、中断、中止に関して生じる損害について、一切の責任を負うものではありません。</p>
  </SmallScrollTextWindow>
</template>